Data cleaning in pandas
you often must clean and transform your data into a suitable format. The initial dat wrangling proces is referred to as as Extract Transform Load(ETL)

In [4]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
import numpy as np

#load data
df = pd.read_csv('Datasets/Yelp_Reviews.csv')
df.head()

,Unnamed: 0,business_id,cool,date,funny,review_id,stars,text,useful,user_id
0,1,pomGBqfbxcqPv14c3XH-ZQ,0,2012-11-13,0,dDl8zu1vWPdKGihJrwQbpw,5,I love this place! My fiance And I go here atl...,0,msQe1u7Z_XuqjGoqhB0J5g
1,2,jtQARsP6P-LbkyjbO1qNGg,1,2014-10-23,1,LZp4UX5zK3e-c5ZGSeo3kA,1,Terrible. Dry corn bread. Rib tips were all fa...,3,msQe1u7Z_XuqjGoqhB0J5g
2,4,Ums3gaP2qM3W1XcA5r6SsQ,0,2014-09-05,0,jsDu6QEJHbwP2Blom1PLCA,5,Delicious healthy food. The steak is amazing. ...,0,msQe1u7Z_XuqjGoqhB0J5g
3,5,vgfcTvK81oD4r50NMjU2Ag,0,2011-02-25,0,pfavA0hr3nyqO61oupj-lA,1,This place sucks. The customer service is horr...,2,msQe1u7Z_XuqjGoqhB0J5g
4,10,yFumR3CWzpfvTH2FCthvVw,0,2016-06-15,0,STiFMww2z31siPY7BWNC2g,5,I have been an Emerald Club member for a numbe...,0,TlvV-xJhmh7LCwJYXkV-cg

In [19]:
df.shape

# Lampda functions - provide a quick and concise way to write functions
# use the .map() or .apply() method to apply a function to a pandas series or DataFrame


# count the number of words in each yelp review:
df['text'].map(lambda review_text: len(review_text.split()))


# Group data
df.groupby('business_id')['stars'].mean().head()

# check for duplicates
df.duplicated().value_counts()

# visually inspect them
df[df.duplicated(keep=False)].sort_values(by='business_id')

df.duplicated().sum()

# Remove duplicates
df = df.drop_duplicates()

# recheck for duplicates
df.duplicated().sum()

df.shape

df.duplicated().value_counts()

False    2277
Name: count, dtype: int64

In [21]:
# Create pivot tables
# this transforms the data into a person by person spreadsheet and what stars they gave various restaurants
# Most values are NaN (null or missing) because people only review a few restaurants of those that exist

usr_reviews = df.pivot(index = 'user_id', columns='business_id', values='stars')
usr_reviews.head(5)

(1010, 2192)

Dealing with Missing data
Identify missing values in a dataframe using built-in methods
Explain why missing values are a problem in data science
Evaluate and execute the best strategy for dealing with missing, duplicate, and erroneous values for a given dataset

In [24]:
# Detecting NaN's
df.isna() # returns a matrix of boolean values where all cells containing NaN are converted to True and all cells
# containing valid data are converted to False.

df.isna().sum()

# Detecting placeholderr value
# Numerical data - outliers - any good placeholder value value will be a value that couldn't show up in the real world
# standard deviation

Unnamed: 0     0
business_id    0
cool           0
date           0
funny          0
review_id      0
stars          0
text           0
useful         0
user_id        0
dtype: int64

In [25]:
# data cleaning in pandas recap
# Lambda functions

import pandas as pd

dates = pd.Series(['12-01-2017', '12-02-2017', '12-03-2017', '12-04-2017'])

dates.map(lambda x: x.split('-')[1])

0    01
1    02
2    03
3    04
dtype: object

In [27]:
# combining dataframes
# you can combine dataframeby merging them(joining data by  a common field) or concatenating them (appending  data at the beining or end)
df1 = pd.DataFrame(dates)
df2 = pd.DataFrame(['12-01-2017', '12-02-2017', '12-03-2017', '12-04-2017'])
pd.concat([df1, df2])

            0
0  12-01-2017
1  12-02-2017
2  12-03-2017
3  12-04-2017
0  12-01-2017
1  12-02-2017
2  12-03-2017
3  12-04-2017

In [33]:
# Grouping and aggregating
df = pd.read_csv('Datasets/titanic.csv')
grouped = df.groupby(['Pclass', 'Sex'])['Age'].mean().reset_index()

grouped.head()

   Pclass     Sex        Age
0       1  female  34.611765
1       1    male  41.281386
2       2  female  28.722973
3       2    male  30.740707
4       3  female  21.750000

in the context of pandas library: pivoting transforms a DataFrame into a new one by  converting selected columns into a new column based on their values. this method allows us to transform a long DataFrame into a wide one where the unique values of a particular column become the column  headers
We csn make better sense of the data and compare different datasets more efficiently.

In [39]:
# Pivot table
import datetime
df = pd.DataFrame(
    {
       "A": ["one", "one", "two", "three"] * 6,
        "B": ["A", "B", "C"] * 8,
        "C": ["foo", "foo", "foo", "bar", "bar", "bar"] * 4,
        "D": np.random.randn(24),
        "E": np.random.randn(24),
        "F": [datetime.datetime(2013, i, 1) for i in range(1, 13)]
        + [datetime.datetime(2013, i, 15) for i in range(1, 13)]
         
    }
)
pd.pivot_table(df, values='D', index=["A", "B"], columns=["C"])

pd.pivot_table(
    df, values=['D', 'E'],
    index=['B'],
    columns=['A', 'C'],
    aggfunc='sum'
)

          D                                                           E  \
A       one               three                 two                 one
C       bar       foo       bar       foo       bar       foo       bar
B
A  0.798586  1.852988 -2.766451       NaN       NaN -0.556169  1.065098
B -0.431026  1.015707       NaN  2.912169 -0.224053       NaN -0.754724
C  0.883911  0.799801  0.226988       NaN       NaN  2.019924  1.050859


A               three                 two
C       foo       bar       foo       bar       foo
B
A  0.749939  2.174605       NaN       NaN  1.102892
B  0.349354       NaN -0.645264 -0.856927       NaN
C -1.315925  1.362873       NaN       NaN -0.280888

In [42]:
import pandas as pd
import numpy as np

# create a random sample DataFrame
names = ['John', 'Mary', 'Joe', 'Mike', 'Sara', 'Peter', 'Amy', 'Tom', 'Lisa', 'Dan']
subjects = ['Math', 'Science', 'English', 'History', 'Art', 'Music', 'Physical Education', 'Geography']

name_list = []
subject_list = []
grade_list = []

for name in names:
    num_subjects = np.random.randint(4, 9) # choose a random number of unique subjects between 4 and 8
    subject_choices =np.random.choice(subjects, size=num_subjects, replace=False) # choose the unique subjects
    for subject in subject_choices:
        grade = np.random.choice(['A', 'B', 'C', 'D', 'F'], p=[0.2, 0.3, 0.3, 0.1, 0.1]) # choose a random grade
        name_list.append(name)
        subject_list.append(subject)
        grade_list.append(grade)
data = {'Name': name_list, 'subject': subject_list, 'Grade': grade_list}

df = pd.DataFrame(data)

# Add a scor column based on te grade column
def get_score(grade):
    if grade == 'A':
        return np.random.randint(80, 101)
    elif grade == 'B':
        return np.random.randint(70, 80)
    elif grade == 'C':
        return np.random.randint(60, 70)
    elif grade == 'D':
        return np.random.randint(50, 60)
    else:
        return np.random.randint(0, 50)
    
df['Score'] = df['Grade'].apply(get_score)

In [44]:
import pandas as pd
import numpy as np

# create a random sample DataFrame
names = ['John', 'Mary', 'Joe', 'Mike', 'Sara', 'Peter', 'Amy', 'Tom', 'Lisa', 'Dan']
subjects = ['Math', 'Science', 'English', 'History', 'Art', 'Music', 'Physical Education', 'Geography']
name_list = []
subject_list = []
grade_list = []
for name in names:
    num_subjects = np.random.randint(4, 9)  # choose a random number of unique subjects between 4 and 8
    subject_choices = np.random.choice(subjects, size=num_subjects, replace=False)  # choose the unique subjects
    for subject in subject_choices:
        grade = np.random.choice(['A', 'B', 'C', 'D', 'F'], p=[0.2, 0.3, 0.3, 0.1, 0.1])  # choose a random grade
        name_list.append(name)
        subject_list.append(subject)
        grade_list.append(grade)
data = {'Name': name_list, 'Subject': subject_list, 'Grade': grade_list}
df = pd.DataFrame(data)

# add a Score column based on the Grade column
def get_score(grade):
    if grade == 'A':
        return np.random.randint(80, 101)
    elif grade == 'B':
        return np.random.randint(70, 80)
    elif grade == 'C':
        return np.random.randint(60, 70)
    elif grade == 'D':
        return np.random.randint(50, 60)
    else:
        return np.random.randint(0, 50)

df['Score'] = df['Grade'].apply(get_score)

# pivot

     Name             Subject Grade  Score
0    John           Geography     B     79
1    John               Music     B     72
2    John             Science     C     60
3    John  Physical Education     A     88
4    John                Math     F     21
5    Mary             English     A     85
6    Mary             Science     A     85
7    Mary                Math     C     62
8    Mary               Music     A     82
9    Mary  Physical Education     D     54
10   Mary           Geography     F     32
11    Joe             Science     A     91
12    Joe             History     B     77
13    Joe  Physical Education     D     54
14    Joe               Music     F     10
15    Joe                Math     B     73
16    Joe           Geography     A     98
17   Mike                 Art     B     73
18   Mike             History     D     59
19   Mike             English     B     75
20   Mike                Math     A     84
21   Mike               Music     F     40
22   Mike             Science     C     65
23   Mike           Geography     F     39
24   Mike  Physical Education     C     63
25   Sara             English     B     71
26   Sara                 Art     F     40
27   Sara                Math     C     65
28   Sara           Geography     C     64
29   Sara             Science     B     79
30  Peter                Math     C     68
31  Peter  Physical Education     F     17
32  Peter           Geography     D     58
33  Peter             Science     C     65
34  Peter                 Art     B     76
35    Amy             History     B     75
36    Amy             Science     B     71
37    Amy                Math     A     80
38    Amy             English     B     71
39    Tom             Science     C     65
40    Tom           Geography     C     60
41    Tom             English     C     60
42    Tom             History     C     66
43    Tom               Music     B     76
44    Tom                 Art     B     77
45   Lisa                 Art     C     62
46   Lisa                Math     D     54
47   Lisa           Geography     C     63
48   Lisa               Music     B     75
49   Lisa             History     D     55
50   Lisa             Science     C     60
51   Lisa  Physical Education     B     79
52    Dan           Geography     C     67
53    Dan                Math     F     12
54    Dan             Science     A     86
55    Dan                 Art     F     14
56    Dan               Music     B     71